---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopAlignmentMethod
source: html/497ae568-c4da-aae7-e684-50c45e2a8940.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopAlignmentMethod Property

"Top Alignment Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelTopAlignmentMethod { get; }
```